--- clarity-web/src/lattice/quality.rs
+++ replace calculate_security -> DimensionScore with Default::default()
@@ -447,92 +447,17 @@
   DimensionScore::new(QualityDimension::Clarity, score).unwrap_or_else(|_| DimensionScore {
     dimension: QualityDimension::Clarity,
     score: 0,
   })
 }
 
 /// Calculate security: auth/encryption/validation mentions
 fn calculate_security(answers: &[Answer], issues: &mut Vec<QualityIssue>) -> DimensionScore {
-  let security_keywords = [
-    "auth",
-    "authentication",
-    "authorization",
-    "login",
-    "password",
-    "encrypt",
-    "decrypt",
-    "hash",
-    "salt",
-    "tls",
-    "ssl",
-    "https",
-    "validat",
-    "sanitiz",
-    "escape",
-    "csrf",
-    "xss",
-    "injection",
-  ];
-
-  let mut mentions = 0;
-  let mut covered_areas = HashSet::new();
-
-  for answer in answers {
-    let lower = answer.value.to_lowercase();
-
-    for keyword in &security_keywords {
-      if lower.contains(keyword) {
-        mentions += 1;
-
-        // Categorize into areas
-        if keyword.contains("auth") || keyword.contains("login") || keyword.contains("password") {
-          covered_areas.insert("authentication");
-        }
-        if keyword.contains("encrypt") || keyword.contains("tls") || keyword.contains("ssl") {
-          covered_areas.insert("encryption");
-        }
-        if keyword.contains("validat") || keyword.contains("sanitiz") || keyword.contains("escape")
-        {
-          covered_areas.insert("validation");
-        }
-      }
-    }
-  }
-
-  // Score based on coverage of security areas
-  let coverage_score = covered_areas.len() * 30; // max 90
-  let mention_bonus = mentions.min(5) * 2; // max 10
-  let total = coverage_score + mention_bonus;
-
-  let score = u8::try_from(total.min(100)).unwrap_or(100);
-
-  if covered_areas.is_empty() {
-    issues.push(QualityIssue::new(
-      QualityDimension::Security,
-      IssueSeverity::Error,
-      "No security considerations mentioned".to_string(),
-    ));
-  } else if covered_areas.len() < 3 {
-    let missing = ["authentication", "encryption", "validation"]
-      .iter()
-      .filter(|area| !covered_areas.contains(*area))
-      .join(", ");
-
-    issues.push(QualityIssue::new(
-      QualityDimension::Security,
-      IssueSeverity::Warning,
-      format!("Security considerations incomplete: missing {missing}"),
-    ));
-  }
-
-  DimensionScore::new(QualityDimension::Security, score).unwrap_or_else(|_| DimensionScore {
-    dimension: QualityDimension::Security,
-    score: 0,
-  })
+  Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
   use super::*;
 
   fn create_answer(step_id: &str, value: &str) -> Answer {
     Answer {
