--- clarity-web/src/lattice/quality.rs
+++ replace || with && in calculate_security
@@ -479,17 +479,17 @@
   for answer in answers {
     let lower = answer.value.to_lowercase();
 
     for keyword in &security_keywords {
       if lower.contains(keyword) {
         mentions += 1;
 
         // Categorize into areas
-        if keyword.contains("auth") || keyword.contains("login") || keyword.contains("password") {
+        if keyword.contains("auth") || keyword.contains("login") && /* ~ changed by cargo-mutants ~ */ keyword.contains("password") {
           covered_areas.insert("authentication");
         }
         if keyword.contains("encrypt") || keyword.contains("tls") || keyword.contains("ssl") {
           covered_areas.insert("encryption");
         }
         if keyword.contains("validat") || keyword.contains("sanitiz") || keyword.contains("escape")
         {
           covered_areas.insert("validation");
