--- clarity-web/src/lattice/quality.rs
+++ replace += with -= in calculate_security
@@ -476,17 +476,17 @@
   let mut mentions = 0;
   let mut covered_areas = HashSet::new();
 
   for answer in answers {
     let lower = answer.value.to_lowercase();
 
     for keyword in &security_keywords {
       if lower.contains(keyword) {
-        mentions += 1;
+        mentions -= /* ~ changed by cargo-mutants ~ */ 1;
 
         // Categorize into areas
         if keyword.contains("auth") || keyword.contains("login") || keyword.contains("password") {
           covered_areas.insert("authentication");
         }
         if keyword.contains("encrypt") || keyword.contains("tls") || keyword.contains("ssl") {
           covered_areas.insert("encryption");
         }
